Сегодня мы поговорим о библиотеке, которая позволяет работать с табличными данными. Она называется pandas

In [1]:
! pip3 list # проверяем список установленных библиотек, вдруг pandas уже есть

Package                      Version
---------------------------- ------------------
aiormq                       3.3.1
appdirs                      1.4.3
appnope                      0.1.0
attrs                        19.3.0
axial-positional-embedding   0.2.1
backcall                     0.1.0
beautiful                    0.0.2
beautifulsoup4               4.9.1
bleach                       3.1.1
blis                         0.4.1
boto3                        1.15.7
botocore                     1.18.7
catalogue                    1.0.0
certifi                      2020.4.5.2
cffi                         1.14.0
chardet                      3.0.4
click                        7.1.2
contrastive-learner          0.1.0
cryptography                 2.9.2
cycler                       0.10.0
cymem                        2.0.3
dataclasses                  0.6
DAWG                         0.8.0
DAWG-Python                  0.7.2
decorator                    4.4.2
defusedxml                   0.6.0
distlib                      0.3.0
docopt                       0.6.2
en-core-web-lg               2.3.1
en-core-web-sm               2.3.1
entrypoints                  0.3
fastscript                   0.1.4
filelock                     3.0.12
fire                         0.3.1
future                       0.18.2
gensim                       3.8.3
graphviz                     0.16
h11                          0.9.0
httptools                    0.1.1
idna                         2.8
ipykernel                    5.1.4
ipython                      7.13.0
ipython-genutils             0.2.0
ipywidgets                   7.5.1
jedi                         0.16.0
Jinja2                       2.11.1
jmespath                     0.10.0
joblib                       0.14.1
json5                        0.9.2
jsonschema                   3.2.0
jupyter-client               6.0.0
jupyter-core                 4.6.3
jupyterlab                   2.0.1
jupyterlab-server            1.0.7
kiwisolver                   1.1.0
kornia                       0.4.1
linear-attention-transformer 0.15.0
linformer                    0.2.0
local-attention              1.1.1
lxml                         4.6.2
markovify                    0.8.3
MarkupSafe                   1.1.1
matplotlib                   3.2.1
mistune                      0.8.4
multidict                    5.1.0
murmurhash                   1.0.2
nbconvert                    5.6.1
nbdev                        0.2.16
nbformat                     5.0.4
networkx                     2.5
neuralcoref                  4.0
nltk                         3.5
notebook                     6.0.3
numpy                        1.18.0
packaging                    20.3
pamqp                        2.3.0
pandas                       1.0.2
pandocfilters                1.4.2
parso                        0.6.2
pexpect                      4.8.0
pickleshare                  0.7.5
Pillow                       8.0.1
pip                          21.0
plac                         1.1.3
preshed                      3.0.2
product-key-memory           0.1.10
prometheus-client            0.7.1
prompt-toolkit               3.0.4
ptyprocess                   0.6.0
py                           1.9.0
pycparser                    2.20
pydantic                     1.3
pydot                        1.4.1
pyenchant                    3.2.0
Pygments                     2.5.2
pymorphy2                    0.9.1
pymorphy2-dicts              2.4.393442.3710985
pymorphy2-dicts-ru           2.4.417127.4579844
pymystem3                    0.1.10
pyparsing                    2.4.6
pyrsistent                   0.15.7
python-dateutil              2.8.1
python-telegram-bot          12.7
pytorch-fid                  0.1.1
pytz                         2019.1
PyYAML                       5.3.1
pyzmq                        19.0.0
regex                        2020.11.13
requests                     2.22.0
retry                        0.9.2
rusenttokenize               0.0.5
russian-tagsets              0.6
s3transfer                   0.3.3
scikit-learn                 0.24.1
scipy                        1.4.1
seaborn                      0.10.0
Send2Trash                   1.5.0
setuptools                   41.2.0
six                          1.14.0
sklearn                      0.0
smart-open                   4.0.1
soup                         0.1.0
soupsieve                    2.0.1
spacy                        2.3.2
squarify                     0.4.3
srsly                        1.0.2
starlette                    0.12.9
stylegan2-pytorch            1.2.6
termcolor                    1.1.0
terminado                    0.8.3
testpath                     0.4.4
thinc                        7.4.1
threadpoolctl                2.1.0
torch                        1.7.0
torchaudio                   0.7.0
torchvision                  0.8.1
tornado                      6.0.4
tqdm                         4.41.1
traitlets                    4.3.3
transliterate                1.10.2
typing-extensions            3.7.4.3
ufal.udpipe                  1.2.0.3
Unidecode                    1.1.1
urllib3                      1.25.10
uvicorn                      0.11.7
uvloop                       0.14.0
vector-quantize-pytorch      0.1.0
virtualenv                   20.0.13
wasabi                       0.8.0
wcwidth                      0.1.8
webencodings                 0.5.1
websockets                   8.1
widgetsnbextension           3.5.1
Wikipedia-API                0.5.4
wordcloud                    1.8.1
xlrd                         1.2.0
yargy                        0.15.0
yarl                         1.6.3

In [2]:
! pip3 install pandas # если pandas не найден, следует запустить эту ячейку

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (1.0.2)
Requirement already satisfied: numpy>=1.13.3 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (1.18.0)
Requirement already satisfied: python-dateutil>=2.6.1 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (2019.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)

In [3]:
import pandas as pd # теперь импортируем pandas в эту тетрадку

документация для pandas [лежит здесь](https://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html)

Основные элементы "табличек в pandas" - это Series и Dataframe

Series - это объект, похожий на одномерный массив (как обычный список в питоне) с элементами и  индексами вдоль каждого элемента из списка. 

DataFrame "собирается" из таких Series

*визуализация "таблички" в pandas* 

<figure class="captioned-images"><div class="attributed-wrap"><img alt="Series vs DataFrame" class="img-responsive" height="383" src="https://storage.googleapis.com/lds-media/images/series-and-dataframe.width-1200.png" width="1000"></div></figure>

Создадим Dataframe:

In [4]:
# шаг 1 создадим словарь

data = {'apples': [3, 2, 0, 1],
        'oranges': [0, 3, 7, 2]
       }

# шаг 2 используем метод pd.DataFrame(), где аргументом подадим созданный словарь
purchases = pd.DataFrame(data) 

# print(purchases) # посмотрим на датафрейм (попробуйте с print и без)

# purchases
display(purchases)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

Как посмотреть, что купил конкретный покупатель? Нам нужны индексы: по строкам работает метод ```.loc```

In [6]:
display(purchases.iloc[3]) # покупатель с индексом 3

apples     1
oranges    2
Name: 3, dtype: int64

Индексы можно задавать не только числовые, но и строковые: давайте сделаем индексацию по именам

In [32]:
purchases = pd.DataFrame(data, index=['Jane', 'Robert', 'Lily', 'David'])

display(purchases)

        apples  oranges
Jane         3        0
Robert       2        3
Lily         0        7
David        1        2

По индексу можно проверить целый ряд в датафрейме. Попробуем посмотртеь на "покупку" по имени.

Для этого понадобится метод ```.loc()```

In [8]:
display(purchases.loc['David'])

apples     1
oranges    2
Name: David, dtype: int64

А как посмотреть все значения какой-нибудь колонки? Для этого достаточно указать ее название в квадратных скобках

In [9]:
purchases['oranges'] # посмотрим на всех покупателей яблок

Jane      0
Robert    3
Lily      7
David     2
Name: oranges, dtype: int64

**как посмотреть или изменить конкретные значения по индексу:**

In [10]:
purchases.loc['Jane',"apples"]=4 # изменим значения яблок для Jane, с 3 на 4

### Добавление колонок и строк в датафрейм

В датафрейм можно добавить новые колонки: понадобится метод ```.assign()```

In [33]:
purchases = purchases.assign(weekday=['Mon',"Wed","Thu","Sat"],
                             daytime=["mor","evn","evn","evn"])


display(purchases)

        apples  oranges weekday daytime
Jane         3        0     Mon     mor
Robert       2        3     Wed     evn
Lily         0        7     Thu     evn
David        1        2     Sat     evn

Добавить строки тоже можно: методом ```.append()```

In [34]:
# шаг1 создадим новый маленький датафрейм: 
df1 = pd.DataFrame({'apples': "3",
                     'oranges': '4',
                        'weekday':"Fri",
                       'daytime':"mor"},
                       index=["Alexander"])
 

df1

          apples oranges weekday daytime
Alexander      3       4     Fri     mor

In [35]:
# шаг2 добавим новый df к старому
purchases = purchases.append(df1)

Что будет если запустить ячейку с ```.append()``` несколько раз?

In [20]:
display(purchases) # посмотрим на результат

          apples oranges weekday daytime
Jane           4       0     Mon     mor
Robert         2       3     Wed     evn
Lily           0       7     Thu     evn
David          1       2     Sat     evn
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor

### что делать, если добавились ненужные строки?

In [21]:
# добавим Монику и Олега
# они ничего не купили, потому что пришли в воскресенье вечером, магазин был закрыт 

purchases = purchases.append(pd.DataFrame({
    'apples': [0,0], 
    'oranges': [0,0],
    'weekday':["Sun","Sun"],
    'daytime':["evn","evn"]},
    
     index=["Monica","Oleg"]))

In [22]:
display(purchases)
# теперь у нас есть Моника и Олег, а еще два раза Александр. 
# Мы хотим удалить лишние строки: Монику, Олега и один раз Александра.

          apples oranges weekday daytime
Jane           4       0     Mon     mor
Robert         2       3     Wed     evn
Lily           0       7     Thu     evn
David          1       2     Sat     evn
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor
Monica         0       0     Sun     evn
Oleg           0       0     Sun     evn

для удаления строк понадобится метод ```.drop()```

In [23]:
# Удалим строки с покупками Моники и Олега
purchases = purchases.drop(["Monica","Oleg"])

In [24]:
display(purchases)

          apples oranges weekday daytime
Jane           4       0     Mon     mor
Robert         2       3     Wed     evn
Lily           0       7     Thu     evn
David          1       2     Sat     evn
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor
Alexander      3       4     Fri     mor

А так можно удалить дубликаты уже существующих строк:

In [25]:
#убираем дупликаты
purchases = purchases.drop_duplicates()

In [26]:
# проверяем, что все хорошо: у нас больше нет ненужных строк и дубликатов
display(purchases)

          apples oranges weekday daytime
Jane           4       0     Mon     mor
Robert         2       3     Wed     evn
Lily           0       7     Thu     evn
David          1       2     Sat     evn
Alexander      3       4     Fri     mor

**как удалить колонки**
Есть несколько вариантов

1) с пересохранением датафрейма

In [53]:
purchases.drop('daytime', axis=1, inplace=True)
# второй аргумент -- это ось (axis): 0 для рядов и 1 для столбцов

display(purchases)

          apples oranges
Jane           3       0
Robert         2       3
Lily           0       7
David          1       2
Alexander      3       4

еще один вариант с пересохранением

In [52]:
purchases = purchases.drop('weekday', 1)
# второй аргумент -- это ось (axis): 0 для рядов и 1 для столбцов

display(purchases)

          apples oranges daytime
Jane           3       0     mor
Robert         2       3     evn
Lily           0       7     evn
David          1       2     evn
Alexander      3       4     mor

2) без сохранения (мы не сохранили результат выражения в переменную)

In [29]:
purchases.drop(["oranges"], 1)

          apples
Jane           4
Robert         2
Lily           0
David          1
Alexander      3

In [30]:
display(purchases) #в актуальном дф колонка "oranges" не исчезла

          apples oranges
Jane           4       0
Robert         2       3
Lily           0       7
David          1       2
Alexander      3       4

### индексы

In [55]:
# сначала быстро вернем колонку weekdays

purchases = purchases.assign(weekday=['Mon',"Wed","Thu","Sat","Fri"])


display(purchases)

          apples oranges weekday
Jane           3       0     Mon
Robert         2       3     Wed
Lily           0       7     Thu
David          1       2     Sat
Alexander      3       4     Fri

Объект DataFrame имеет 2 индекса: по строкам и по столбцам.

In [56]:
display(purchases.index)

Index(['Jane', 'Robert', 'Lily', 'David', 'Alexander'], dtype='object')

In [57]:
print('indices are:', purchases.index, "\n")

print('columns are:', purchases.columns)

indices are: Index(['Jane', 'Robert', 'Lily', 'David', 'Alexander'], dtype='object')

columns are: Index(['apples', 'oranges', 'weekday'], dtype='object')

In [58]:
# пересечение индексов выдаст конкретную ячейку: ищем сколько яблок купил Роберт

display(purchases.loc['Robert']['apples'])

2

**Доступ к строкам по индексу** можно делать несколькими способами:

```.loc``` - используется для доступа по строке

```.iloc``` - используется для доступа по числовому значению (начиная от 0)

In [59]:
purchases.loc['Jane'] # по названию индекса

apples       3
oranges      0
weekday    Mon
Name: Jane, dtype: object

In [60]:
purchases.iloc[-1] # по номеру строки (у первой строки нулевой индекс)

# что покажет индекс -1 ?

apples       3
oranges      4
weekday    Fri
Name: Alexander, dtype: object

### характеристики датафрейма:

In [61]:
purchases.shape #размеры датафрейма

(5, 3)

In [62]:
purchases.describe()

       apples  oranges weekday
count       5        5       5
unique      5        5       5
top         3        7     Wed
freq        1        1       1

In [63]:
purchases.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Jane to Alexander
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   apples   5 non-null      object
 1   oranges  5 non-null      object
 2   weekday  5 non-null      object
dtypes: object(3)
memory usage: 320.0+ bytes

так можно посмотреть уникальные значения индексов:

In [64]:
purchases.columns.unique()

Index(['apples', 'oranges', 'weekday'], dtype='object')

In [65]:
purchases.index.unique()

Index(['Jane', 'Robert', 'Lily', 'David', 'Alexander'], dtype='object')

### Сохранение в файл и чтение из файла

In [66]:
# сохраним в .csv файл

purchases.to_csv('purchases.csv')

In [67]:
# прочитаем файл

df = pd.read_csv('purchases.csv')
display(df)

  Unnamed: 0  apples  oranges weekday
0       Jane       3        0     Mon
1     Robert       2        3     Wed
2       Lily       0        7     Thu
3      David       1        2     Sat
4  Alexander       3        4     Fri

### фильтрация значений

In [68]:
purchases[purchases['weekday'] =='Fri'] # посмотрим, кто совершал покупки в пятницу

          apples oranges weekday
Alexander      3       4     Fri

In [69]:
df.columns = ['names','apples','oranges',"weekday"]

In [70]:
df

       names  apples  oranges weekday
0       Jane       3        0     Mon
1     Robert       2        3     Wed
2       Lily       0        7     Thu
3      David       1        2     Sat
4  Alexander       3        4     Fri

In [72]:
df.iloc[2] # поиск по индексу (= по строке в табличке)

names      Lily
apples        0
oranges       7
weekday     Thu
Name: 2, dtype: object

In [73]:
df[df["apples"] >= 2] #фильтр на значение столбца: ищем покупателей у которых 2 и более яблока

       names  apples  oranges weekday
0       Jane       3        0     Mon
1     Robert       2        3     Wed
4  Alexander       3        4     Fri

In [74]:
newdf = df[df["apples"] >= 2]
newdf

       names  apples  oranges weekday
0       Jane       3        0     Mon
1     Robert       2        3     Wed
4  Alexander       3        4     Fri

In [75]:
df[(df["apples"] >= 0) | (df["oranges"] > 0)] #ищем, кто купил хотя бы одно яблоко или апельсин

       names  apples  oranges weekday
0       Jane       3        0     Mon
1     Robert       2        3     Wed
2       Lily       0        7     Thu
3      David       1        2     Sat
4  Alexander       3        4     Fri

больше про логические операторы в выражениях: [тут](https://stackoverflow.com/questions/36921951/truth-value-of-a-series-is-ambiguous-use-a-empty-a-bool-a-item-a-any-o)

Над значениями в ячейках можно производить различные операции:
* например, арифметические:

In [77]:
print("apples:", df["apples"].sum(), "oranges:", df["oranges"].sum())

apples: 9 oranges: 16

In [79]:
df["fruits"] = df["apples"]+df["oranges"]

In [85]:
display(df)

       names  apples  oranges weekday  fruits
0       Jane       3        0     Mon       3
1     Robert       2        3     Wed       5
2       Lily       0        7     Thu       7
3      David       1        2     Sat       3
4  Alexander       3        4     Fri       7

 25  фруктов было куплено всего

In [101]:
display(df.loc[:,["names", "fruits"]]) 
# первый аргумент (двоеточие без индексов слева и справа) означает "все строки".
#Второй аргумент -- нужные колонки

print("\n",df["fruits"].sum()," фруктов было куплено всего")

       names  fruits
0       Jane       3
1     Robert       5
2       Lily       7
3      David       3
4  Alexander       7

 25  фруктов было куплено всего

можно искать что-то по подстроке (найдем с помощью рег.выражения всех покупателей с буквой R/r в имени)

In [94]:
df[df["names"].str.match(r"(R|.+r)")]

       names  apples  oranges weekday  fruits
1     Robert       2        3     Wed       5
4  Alexander       3        4     Fri       7

усложненный поиск по индексу

In [102]:
newdf = df.loc[0:2, ["apples", "oranges"]]
# первый аргумент задает интервал индексов, второй -- нужные колонки
display(newdf)

   apples  oranges
0       3        0
1       2        3
2       0        7

In [96]:
df.loc[0:2, ["apples", "fruits"]]

   apples  fruits
0       3       3
1       2       5
2       0       7

### ДЗ

давайте поизвлекаем текст из датасетов и поисследуем его

In [103]:
df = pd.read_csv('elonmusk.csv', encoding="utf-8")

In [105]:
df.head(3) # этот метод позволяет визуально оценить датафрейм

,id,conversation_id,created_at,date,time,timezone,user_id,username,name,place,...,geo,source,user_rt_id,user_rt,retweet_id,reply_to,retweet_date,translate,trans_src,trans_dest
0,1282939902531796993,1282933079431151618,1594711683000,2020-07-14,07:28:03,UTC,44196397,elonmusk,Elon Musk,NaN,...,NaN,NaN,NaN,NaN,NaN,"[{'user_id': '44196397', 'username': 'elonmusk...",NaN,NaN,NaN,NaN
1,1282844872571904000,1282801938111791104,1594689026000,2020-07-14,01:10:26,UTC,44196397,elonmusk,Elon Musk,NaN,...,NaN,NaN,NaN,NaN,NaN,"[{'user_id': '44196397', 'username': 'elonmusk...",NaN,NaN,NaN,NaN
2,1282805559834492929,1282758532312584193,1594679653000,2020-07-13,22:34:13,UTC,44196397,elonmusk,Elon Musk,NaN,...,NaN,NaN,NaN,NaN,NaN,"[{'user_id': '44196397', 'username': 'elonmusk...",NaN,NaN,NaN,NaN

In [107]:
df.info() # вся информация о датафрейме

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9286 entries, 0 to 9285
Data columns (total 34 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               9286 non-null   int64
 1   conversation_id  9286 non-null   int64
 2   created_at       9286 non-null   int64
 3   date             9286 non-null   object
 4   time             9286 non-null   object
 5   timezone         9286 non-null   object
 6   user_id          9286 non-null   int64
 7   username         9286 non-null   object
 8   name             9286 non-null   object
 9   place            0 non-null      float64
 10  tweet            9286 non-null   object
 11  mentions         9286 non-null   object
 12  urls             9286 non-null   object
 13  photos           9286 non-null   object
 14  replies_count    9286 non-null   int64
 15  retweets_count   9286 non-null   int64
 16  likes_count      9286 non-null   int64
 17  hashtags         9286 non-null   object
 18  cashtags         9286 non-null   object
 19  link             9286 non-null   object
 20  retweet          9286 non-null   bool
 21  quote_url        355 non-null    object
 22  video            9286 non-null   int64
 23  near             0 non-null      float64
 24  geo              0 non-null      float64
 25  source           0 non-null      float64
 26  user_rt_id       0 non-null      float64
 27  user_rt          0 non-null      float64
 28  retweet_id       0 non-null      float64
 29  reply_to         9286 non-null   object
 30  retweet_date     0 non-null      float64
 31  translate        0 non-null      float64
 32  trans_src        0 non-null      float64
 33  trans_dest       0 non-null      float64
dtypes: bool(1), float64(11), int64(8), object(14)
memory usage: 2.3+ MB

### подсказка: как достать текст из колонок датафрейма

In [108]:
df["tweet"] # конкретно в этом дф тексты хранятся в колонке "tweet"

0                                                    Cute
1                                                     Wow
2       Reusability is essential. A rocket that is sin...
3                                             Wild times!
4       We’re being extra paranoid. Maximizing probabi...
                              ...
9281    Prob good though. Will give us time to replace...
9282    Air Force tracking radar went down. Launch pos...
9283    Rocket reentry will be much tougher this time ...
9284    Launching our 1st deep space mission today. He...
9285    If you are curious about the P85D, you can sch...
Name: tweet, Length: 9286, dtype: object

In [110]:
df["tweet"].values

array(['Cute', 'Wow',
       'Reusability is essential. A rocket that is single use is just as absurd as a single use airplane. F9 engines already fire 3 times per flight.',
       ...,
       'Rocket reentry will be much tougher this time around due to deep space mission. Almost 2X force and 4X heat. Plenty of hydraulic fluid tho.',
       'Launching our 1st deep space mission today. Headed to Earth-Sun L1 gravity null point at 1M miles, 4X further than moon.',
       'If you are curious about the P85D, you can schedule a test drive here: http://ts.la/dE\xa0'],
      dtype=object)

In [111]:
tweets = list(df["tweet"].values) # сохраним в привычный питонский список

In [112]:
tweets[200:205] # посмотрим на какие-то выборочно

['Likely true',
 'Yes',
 'Starlink will provide global coverage',
 'Worth discussing at annual shareholders meeting',
 'Party on …']

Теперь текст сохранен в переменную в виде списка, с ним можно работать стандартным образом